app/controllers/api/questions_controller.rb

    def create
        @question = Question.new(question_params)
        # @question.author_id = current_user.id
        if @question.save
---
INSERT INTO "questions" ("title", "body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hello"], ["body", "hello1"], ["author_id", 1], ["created_at", "2020-05-05 07:25:00.794748"], ["updated_at", "2020-05-05 07:25:00.794748"]]

    def update
        @question = Question.find(params[:id])
        if @question.update(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
UPDATE "questions" SET "body" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["body", "to see if it work"], ["updated_at", "2020-05-06 01:11:21.329214"], ["id", 32]]

    def destroy
        @question = Question.find(params[:id])
        if @question
            @question.destroy
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 36]]