app/views/api/questions/_question.json.jbuilder

json.votes question.votes
json.secs Time.now - question.created_at
---
INSERT INTO "questions" ("title", "body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hello"], ["body", "hello1"], ["author_id", 1], ["created_at", "2020-05-05 07:25:00.794748"], ["updated_at", "2020-05-05 07:25:00.794748"]]